---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.IsSKPImportLinkAvailable
source: html/22b0cd7f-65d5-0438-87e6-5da9d997458d.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.IsSKPImportLinkAvailable Method

Checks whether the SKP Import/Link functionality is available in the installed Revit.

## Syntax (C#)
```csharp
public static bool IsSKPImportLinkAvailable()
```

## Returns
True if the SKP Import/Link functionality is available in the installed Revit.

## Remarks
SKP Import/Link is optional functionality that does not have to be part of the Revit installation.